; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	spectrograph0 - mode
	image3 - mode
	thermograph5 - mode
	spectrograph6 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph6)
	(supports instrument1 image4)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph6)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 thermograph1)
	(supports instrument3 image2)
	(supports instrument3 image3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 image2)
	(supports instrument4 image4)
	(supports instrument4 image3)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph1)
	(supports instrument5 image4)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
)
(:goal (and
	(pointing satellite1 Planet10)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 thermograph5)
	(have_image Planet7 image4)
	(have_image Star8 thermograph1)
	(have_image Star8 spectrograph6)
	(have_image Star9 thermograph5)
	(have_image Planet10 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation3 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon5)
   goals met: 0 of 8
5. (turn_to satellite1 groundstation3 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
6. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
7. (take_image satellite2 phenomenon5 instrument5 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 1 of 8
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 8
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 8
10. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 1 of 8
11. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 8
12. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 1 of 8
13. (take_image satellite0 star8 instrument2 spectrograph6)
   added: (have_image star8 spectrograph6)
   goals met: 2 of 8
14. (take_image satellite0 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 3 of 8
15. (turn_to satellite1 planet10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet10)
   goals met: 4 of 8
16. (take_image satellite1 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 5 of 8
17. (turn_to satellite2 planet6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet6)
   goals met: 5 of 8
18. (take_image satellite2 planet6 instrument5 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 6 of 8
19. (turn_to satellite2 planet7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet7)
   goals met: 6 of 8
20. (take_image satellite2 planet7 instrument5 image4)
   added: (have_image planet7 image4)
   goals met: 7 of 8
21. (turn_to satellite2 star9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star9)
   goals met: 7 of 8
22. (take_image satellite2 star9 instrument5 thermograph5)
   added: (have_image star9 thermograph5)
   goals met: 8 of 8
